#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.application.module.parameters.random_password.db_password: Refreshing state... [id=none]
module.application.module.parameters.aws_ssm_parameter.database_password: Refreshing state... [id=/servian/development/DBPASSWORD]
module.application.module.parameters.aws_ssm_parameter.database_port: Refreshing state... [id=/servian/development/DBPORT]
module.application.module.parameters.aws_ssm_parameter.database_listenport: Refreshing state... [id=/servian/development/LISTENPORT]
module.application.module.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0fdcea59cfd20b129]
module.application.module.parameters.aws_ssm_parameter.database_type: Refreshing state... [id=/servian/development/DBTYPE]
module.application.module.parameters.aws_ssm_parameter.database_name: Refreshing state... [id=/servian/development/DBNAME]
module.application.module.parameters.aws_ssm_parameter.database_username: Refreshing state... [id=/servian/development/DBUSER]
module.application.module.parameters.aws_ssm_parameter.database_listenhost: Refreshing state... [id=/servian/development/LISTENHOST]
module.application.module.network.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0ff887fab85467fb1]
module.application.module.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0474cef124368e3e1]
module.application.module.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-060feced49b3a44af]
module.application.module.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e8b0138aa89f1fa9]
module.application.module.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06b174b588096ddf4]
module.application.module.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fe0413931face70d]
module.application.module.network.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0b080358d874bbd3f]
module.application.module.network.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0bc9a1e005839089b]
module.application.module.network.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-039a2e104707ae992]
module.application.module.network.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0d11ea9d3443c81ad]
module.application.module.network.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-084c469730faa109f]
module.application.module.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0308467172c006037]
module.application.module.network.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-03775570b7f628cd5]
module.application.module.network.module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-093d3608f8a22d302]
module.application.module.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-082311b27d93f90d0]
module.application.module.network.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=servian-development-vpc]
module.application.module.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0dc78c23e4196e305]
module.application.module.network.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0124dcf54b66baa7c]
module.application.module.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0720a8f70093532fc]
module.application.module.network.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0fa6a9f7de88aa547]
module.application.module.network.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0ebf5054b4aa62e3f]
module.application.module.network.module.vpc.aws_route.database_internet_gateway[0]: Refreshing state... [id=r-rtb-093d3608f8a22d3021080289494]
module.application.module.network.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-03344a6838b06b9dd]
module.application.module.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09353b76410ebd07f]
module.application.module.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0db040981407ff8a1]
module.application.module.network.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0ec9bc6638dbed253]
module.application.module.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-082311b27d93f90d01080289494]
module.application.module.database.aws_security_group.db: Refreshing state... [id=sg-08fde0ee227f7cb3b]
module.application.module.database.module.database.module.db_instance.data.aws_partition.current: Reading...
module.application.module.database.module.database.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.module.database.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.application.module.database.module.database.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=servian-development-20221124131929575700000001]
module.application.module.database.module.database.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.application.module.database.module.database.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=servian-development]
module.application.module.database.aws_ssm_parameter.database_host: Refreshing state... [id=/servian/development/DBHOST]
module.application.module.computing.module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:targetgroup/app-20221124132903687100000002/83a3847ed759c92d]
module.application.module.computing.aws_cloudwatch_log_group.logs: Refreshing state... [id=/fargate/service/servian-development-fargate-log]
module.application.module.computing.aws_security_group.alb: Refreshing state... [id=sg-06bf13de35ed582fc]
module.application.module.computing.data.aws_acm_certificate.certificate: Reading...
module.application.module.computing.module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:293094141207:cluster/servian-development]
module.application.module.computing.data.aws_ssm_parameters_by_path.parameters: Reading...
module.application.module.computing.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=servian-development-fargate-task-execution-role]
module.application.module.computing.data.aws_ssm_parameters_by_path.parameters: Read complete after 0s [id=/servian/development/]
module.application.module.computing.aws_security_group.fargate: Refreshing state... [id=sg-078585ab80e4d3c62]
module.application.module.computing.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:loadbalancer/app/servian-development/c0332024614202e4]
module.application.module.computing.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment_ecr: Refreshing state... [id=servian-development-fargate-task-execution-role-20221124132906237100000003]
module.application.module.computing.aws_ecs_task_definition.web-app: Refreshing state... [id=servian-development]
module.application.module.computing.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment_ssm: Refreshing state... [id=servian-development-fargate-task-execution-role-20221124132906793300000005]
module.application.module.computing.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment: Refreshing state... [id=servian-development-fargate-task-execution-role-20221124132906515000000004]
module.application.module.computing.module.ecs.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=servian-development]
module.application.module.computing.aws_ecs_service.web-app: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:293094141207:service/servian-development/servian-development]
module.application.module.computing.module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:listener/app/servian-development/c0332024614202e4/1a0421565ecb1ccb]
module.application.module.computing.data.aws_acm_certificate.certificate: Read complete after 1s [id=arn:aws:acm:ap-southeast-2:293094141207:certificate/fbde8c2c-6a20-4638-bb46-755c41fad650]
module.application.module.computing.module.alb.aws_lb_listener.frontend_https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:listener/app/servian-development/c0332024614202e4/c7c5a1ccca2b3d26]
module.application.module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z0592131H7R4DNYDOBTK_servian-dev.site_A]
module.application.module.dns.aws_route53_record.www: Refreshing state... [id=Z0592131H7R4DNYDOBTK_www_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.application.module.computing.aws_ecs_service.web-app will be updated in-place
  ~ resource "aws_ecs_service" "web-app" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:ap-southeast-2:293094141207:service/servian-development/servian-development"
        name                               = "servian-development"
        tags                               = {}
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.application.module.dns.data.aws_route53_zone.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "this" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "servian-dev.site"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.application.module.dns.aws_route53_record.ipv4 must be replaced
-/+ resource "aws_route53_record" "ipv4" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "servian-dev.site" -> (known after apply)
      ~ id              = "Z0592131H7R4DNYDOBTK_servian-dev.site_A" -> (known after apply)
        name            = "servian-dev.site"
      - records         = [] -> null
      - ttl             = 0 -> null
      ~ zone_id         = "Z0592131H7R4DNYDOBTK" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.application.module.dns.aws_route53_record.www must be replaced
-/+ resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "www.servian-dev.site" -> (known after apply)
      ~ id              = "Z0592131H7R4DNYDOBTK_www_CNAME" -> (known after apply)
        name            = "www"
      ~ zone_id         = "Z0592131H7R4DNYDOBTK" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workspace: `development`, Workflow: `Terraform Plan`*